In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn
import string

* ### Series is just single colum of data

In [2]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [3]:
alphalist = list(string.ascii_uppercase)
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [4]:
index1 = [alphalist[i] for i in range(10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [5]:
serie1 = pd.Series(data=data1,index=index1)
serie1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [6]:
dico = {k:v for k,v in zip(index1,data1) }

In [7]:
serie2 = pd.Series(dico)
serie2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [8]:
df = pd.DataFrame(randn(5,5),index='A/B/C/D/E'.split('/'), columns='V/W/X/Y/Z'.split("/"))
df

          V         W         X         Y         Z
A  0.478029  0.222275 -1.713991 -0.289055 -1.472209
B  1.998814 -0.068745 -0.398577 -1.836231 -1.500615
C -0.165022 -0.462716  1.491018  0.328102  0.245732
D -1.382323  1.129531  1.422767 -0.731570 -0.492096
E  0.182690 -0.009573 -0.193171  0.415882 -0.513913

In [24]:
df.loc['D'][['X','Z']]

X    1.422767
Z   -0.492096
Name: D, dtype: float64

In [27]:
df[['X','Z']].loc['D']

X    1.422767
Z   -0.492096
Name: D, dtype: float64

In [28]:
df[['X','Z']].iloc[3]

X    1.422767
Z   -0.492096
Name: D, dtype: float64

In [22]:
df.iloc[1]['X']

-0.3985771471885359

In [21]:
df[['W','Y']]

          W         Y
A  0.222275 -0.289055
B -0.068745 -1.836231
C -0.462716  0.328102
D  1.129531 -0.731570
E -0.009573  0.415882

In [18]:
df.iloc[0]

V    0.478029
W    0.222275
X   -1.713991
Y   -0.289055
Z   -1.472209
U   -0.994181
Name: A, dtype: float64

In [19]:
df.loc['A']

V    0.478029
W    0.222275
X   -1.713991
Y   -0.289055
Z   -1.472209
U   -0.994181
Name: A, dtype: float64

In [9]:
# Selecting Columns
df[['V','X']]

          V         X
A  0.478029 -1.713991
B  1.998814 -0.398577
C -0.165022  1.491018
D -1.382323  1.422767
E  0.182690 -0.193171

In [10]:
df[['W','Y']]

          W         Y
A  0.222275 -0.289055
B -0.068745 -1.836231
C -0.462716  0.328102
D  1.129531 -0.731570
E -0.009573  0.415882

In [11]:
# We use iloc to select a particular row
df.iloc[0]

V    0.478029
W    0.222275
X   -1.713991
Y   -0.289055
Z   -1.472209
Name: A, dtype: float64

In [12]:
df[['X','Z']].loc[['A','B']]

          X         Z
A -1.713991 -1.472209
B -0.398577 -1.500615

In [13]:
df.loc[['A','B','C']]

          V         W         X         Y         Z
A  0.478029  0.222275 -1.713991 -0.289055 -1.472209
B  1.998814 -0.068745 -0.398577 -1.836231 -1.500615
C -0.165022 -0.462716  1.491018  0.328102  0.245732

In [14]:
df[df['W']> 0]

          V         W         X         Y         Z
A  0.478029  0.222275 -1.713991 -0.289055 -1.472209
D -1.382323  1.129531  1.422767 -0.731570 -0.492096

In [15]:
df['U']  = df['V']+df['Z'] # adding new column to the data frame

In [16]:
df

          V         W         X         Y         Z         U
A  0.478029  0.222275 -1.713991 -0.289055 -1.472209 -0.994181
B  1.998814 -0.068745 -0.398577 -1.836231 -1.500615  0.498200
C -0.165022 -0.462716  1.491018  0.328102  0.245732  0.080710
D -1.382323  1.129531  1.422767 -0.731570 -0.492096 -1.874419
E  0.182690 -0.009573 -0.193171  0.415882 -0.513913 -0.331223

In [17]:
df[df['U'] > df['V']]

          V         W         X         Y         Z        U
C -0.165022 -0.462716  1.491018  0.328102  0.245732  0.08071

In [31]:
df.head() # This will return the first five rows of the data frame

          V         W         X         Y         Z         U
A  0.478029  0.222275 -1.713991 -0.289055 -1.472209 -0.994181
B  1.998814 -0.068745 -0.398577 -1.836231 -1.500615  0.498200
C -0.165022 -0.462716  1.491018  0.328102  0.245732  0.080710
D -1.382323  1.129531  1.422767 -0.731570 -0.492096 -1.874419
E  0.182690 -0.009573 -0.193171  0.415882 -0.513913 -0.331223

In [32]:
df.tail()# This will return the last five rows of your data frame

          V         W         X         Y         Z         U
A  0.478029  0.222275 -1.713991 -0.289055 -1.472209 -0.994181
B  1.998814 -0.068745 -0.398577 -1.836231 -1.500615  0.498200
C -0.165022 -0.462716  1.491018  0.328102  0.245732  0.080710
D -1.382323  1.129531  1.422767 -0.731570 -0.492096 -1.874419
E  0.182690 -0.009573 -0.193171  0.415882 -0.513913 -0.331223

In [33]:
df.tail(2)

          V         W         X         Y         Z         U
D -1.382323  1.129531  1.422767 -0.731570 -0.492096 -1.874419
E  0.182690 -0.009573 -0.193171  0.415882 -0.513913 -0.331223

* # Concatinate

In [41]:
df1  = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3']},index =[0,1,2,3])

In [42]:
df2  = pd.DataFrame({'A':['A4','A5','A6','A7'],
                     'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7']},index =[0,1,2,3])

In [43]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [46]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

# : Merging and joining data frame

* # Merging

In [66]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [67]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [70]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [71]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [72]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [73]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [74]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

* # Join

In [75]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [76]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## Groupby

In [60]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[290,380,320,194,243,350]}

In [61]:
df = pd.DataFrame(data)

In [62]:
df

  Company   Person  Sales
0    GOOG      Sam    290
1    GOOG  Charlie    380
2    MSFT      Amy    320
3    MSFT  Vanessa    194
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [63]:
df.groupby('Company')

In [64]:
df_by_comp = df.groupby("Company")

In [65]:
df_by_comp.mean()

         Sales
Company
FB       296.5
GOOG     335.0
MSFT     257.0

In [ ]:
# std, min, max, describe etc..